Revit 2027 API
MultiReferenceAnnotationOptions.TagHeadPosition Property
 The position for the tag's head.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ TagHeadPosition { get; set; }
Public Property TagHeadPosition As XYZ
	Get
	Set
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
member TagHeadPosition : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace